README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>irnb(i ruby note book) or org ruby note book</title>
<!-- 2018-08-09 木 10:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="関西学院大学・理工学部・情報科学科　西谷滋人 2018" />
<link rel="stylesheet" type="text/css" href="/Users/bob/Github/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/Users/bob/Github/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/default.min.css"></head>
<body>
<div id="content">
<h1 class="title">irnb(i ruby note book) or org ruby note book</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Irnb</a>
<ul>
<li><a href="#sec-1-1">1.1. background</a></li>
<li><a href="#sec-1-2">1.2. Installation</a></li>
<li><a href="#sec-1-3">1.3. Usage</a></li>
<li><a href="#development">1.4. Development</a></li>
<li><a href="#contributing">1.5. Contributing</a></li>
<li><a href="#license">1.6. License</a></li>
<li><a href="#code-of-conduct">1.7. Code of Conduct</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Irnb</h2>
<div class="outline-text-2" id="text-1">
<p>
ipynbみたいにnotebookをorg+rubyで容易に作成できるsystem
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> background</h3>
<div class="outline-text-3" id="text-1-1">
<p>
文書作成は規模の小さいうちはいいが大きくなるにつれて破綻する．
それは，毎週のレポートでもそうだし，さらに学期末試験や卒業論文に
なったら悲惨．
</p>

<p>
それらをうまく乗り越えるには，小さい時と大きくなった時で，
文書やdirectoryが相似形になっているフラクタル構造が理想的．
そうすれば規模が大きくなっても対応できるという安心感があるから．
どのような粒度の知識であろうと，学習の最初から構造化されたノートを
提供しようというのがirnbの理想．そしてstageの進化をsupportしてくれる．．．
</p>

<p>
gemspecは面白い役割を持ったfileかも．
規模が大きくなって下に増やしていく時にはpercpectiveがわかりやすいが，
上に付け足す，あるいは下に入る時にはそれらを統括する箇所，
本でいうところの章の概要みたいなものかな．．．
でもそれはREADME.orgだな．．．
上へのlinkはdirectoryで管理できないから．
</p>

<p>
末枝と主枝だけは違う構造だな．
だって，main branchのREADME.orgはtocだろうし，
末枝はfirststage的構造だろうから．
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Add this line to your application's Gemfile:
</p>

<div class="org-src-container">

<pre class="src src-ruby">gem 'irnb'
</pre>
</div>

<p>
And then execute:
</p>

<pre class="example">
$ bundle
</pre>

<p>
Or install it yourself as:
</p>

<pre class="example">
$ gem install irnb
</pre>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Usage</h3>
</div>


<div id="outline-container-development" class="outline-3">
<h3 id="development"><a id="sec-1-4" name="sec-1-4"></a><span class="section-number-3">1.4</span> Development</h3>
<div class="outline-text-3" id="text-development">

<p>
After checking out the repo, run <code>bin/setup</code> to install dependencies.
Then, run <code>rake test</code> to run the tests. You can also run <code>bin/console</code>
for an interactive prompt that will allow you to experiment.
</p>

<p>
To install this gem onto your local machine, run
<code>bundle exec rake install</code>. To release a new version, update the version
number in <code>version.rb</code>, and then run <code>bundle exec rake release</code>, which
will create a git tag for the version, push git commits and tags, and
push the <code>.gem</code> file to <a href="https://rubygems.org">rubygems.org</a>.
</p>
</div>
</div>

<div id="outline-container-contributing" class="outline-3">
<h3 id="contributing"><a id="sec-1-5" name="sec-1-5"></a><span class="section-number-3">1.5</span> Contributing</h3>
<div class="outline-text-3" id="text-contributing">

<p>
Bug reports and pull requests are welcome on GitHub at
<a href="https://github.com/[USERNAME]/irnb">https://github.com/[USERNAME]/irnb</a>. This project is intended to be a
safe, welcoming space for collaboration, and contributors are expected
to adhere to the <a href="http://contributor-covenant.org">Contributor
Covenant</a> code of conduct.
</p>
</div>
</div>

<div id="outline-container-license" class="outline-3">
<h3 id="license"><a id="sec-1-6" name="sec-1-6"></a><span class="section-number-3">1.6</span> License</h3>
<div class="outline-text-3" id="text-license">

<p>
The gem is available as open source under the terms of the
<a href="https://opensource.org/licenses/MIT">MIT License</a>.
</p>
</div>
</div>

<div id="outline-container-code-of-conduct" class="outline-3">
<h3 id="code-of-conduct"><a id="sec-1-7" name="sec-1-7"></a><span class="section-number-3">1.7</span> Code of Conduct</h3>
<div class="outline-text-3" id="text-code-of-conduct">

<p>
Everyone interacting in the Irnb project's codebases, issue trackers,
chat rooms and mailing lists is expected to follow the
<a href="https://github.com/[USERNAME]/irnb/blob/master/CODE_OF_CONDUCT.md">code
of conduct</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 関西学院大学・理工学部・情報科学科　西谷滋人 2018</p>
<p class="date">Created: 2018-08-09 木 10:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
